# Metin Operasyonları

In [82]:
import pandas as pd
import numpy as np

## Pandas String metotlar

In [83]:
isim = pd.Series(["99","gaNdalf","aragorn","legolas","frodo"])

In [84]:
isim

0         99
1    gaNdalf
2    aragorn
3    legolas
4      frodo
dtype: object

In [85]:
isim.str.upper()

0         99
1    GANDALF
2    ARAGORN
3    LEGOLAS
4      FRODO
dtype: object

In [86]:
isim.str.lower()

0         99
1    gandalf
2    aragorn
3    legolas
4      frodo
dtype: object

In [87]:
isim.str.capitalize()

0         99
1    Gandalf
2    Aragorn
3    Legolas
4      Frodo
dtype: object

In [88]:
isim.str.title()

0         99
1    Gandalf
2    Aragorn
3    Legolas
4      Frodo
dtype: object

In [89]:
seri = ["Churchill,Hirohito,Roosevelt,Stalin","ENG,JP,USA,USSR"]

In [90]:
ww2 = pd.Series(seri)

In [91]:
len(ww2)

2

In [92]:
ww2

0    Churchill,Hirohito,Roosevelt,Stalin
1                        ENG,JP,USA,USSR
dtype: object

In [93]:
ww2 = ww2.str.split(",",expand=True)

In [94]:
ww2

           0         1          2       3
0  Churchill  Hirohito  Roosevelt  Stalin
1        ENG        JP        USA    USSR

In [95]:
type(ww2)

pandas.core.frame.DataFrame

## String Düzenleme

In [96]:
temiz = pd.Series(["      gandalf the wizard",
                   "Aragorn son of arathorn",
                   "leg#las sindarin",
                   "frodo baggings    "])

In [97]:
temiz

0          gandalf the wizard
1     Aragorn son of arathorn
2            leg#las sindarin
3          frodo baggings
dtype: object

In [98]:
temiz.str.strip()

0         gandalf the wizard
1    Aragorn son of arathorn
2           leg#las sindarin
3             frodo baggings
dtype: object

In [99]:
temiz.str.replace("#","o")

0          gandalf the wizard
1     Aragorn son of arathorn
2            legolas sindarin
3          frodo baggings
dtype: object

In [100]:
temiz.str.strip().str.replace("#","o").str.title()

0         Gandalf The Wizard
1    Aragorn Son Of Arathorn
2           Legolas Sindarin
3             Frodo Baggings
dtype: object

In [101]:
def temizlik(temiz):

    temiz = temiz.strip()
    temiz = temiz.title()

    return temiz

In [102]:
temiz.apply(temizlik)

0         Gandalf The Wizard
1    Aragorn Son Of Arathorn
2           Leg#Las Sindarin
3             Frodo Baggings
dtype: object

In [103]:
np.vectorize(temizlik)(temiz)

array(['Gandalf The Wizard', 'Aragorn Son Of Arathorn',
       'Leg#Las Sindarin', 'Frodo Baggings'], dtype='<U23')

In [104]:
import timeit


setup = '''
import numpy as np
import pandas as pd

temiz = pd.Series(["      gandalf the wizard",
                   "Aragorn son of arathorn",
                   "leg#las sindarin",
                   "frodo baggings    "])


def temizlik(temiz):

    temiz = temiz.strip()
    temiz = temiz.title()
    return temiz
'''


stmt_pandas_str = '''

temiz.str.strip().str.title()

'''

stmt_pandas_apply = '''

temiz.apply(temizlik)

'''

stmt_pandas_vectorize = '''

np.vectorize(temizlik)(temiz)

'''

In [105]:
timeit.timeit(setup = setup,
              stmt = stmt_pandas_str,
              number = 10000)

1.6677443999942625

In [106]:
timeit.timeit(setup = setup,
              stmt = stmt_pandas_apply,
              number = 10000)

0.7933185000001686

In [107]:
timeit.timeit(setup = setup,
              stmt = stmt_pandas_vectorize,
              number = 10000)

0.20490260000224225

## Datetime

In [108]:
from datetime import datetime

In [109]:
year = 1920
month = 4
day = 23
hour = 14
minute = 15
second = 10

In [110]:
birinci_meclis = datetime(year,month,day)

In [111]:
birinci_meclis

datetime.datetime(1920, 4, 23, 0, 0)

In [112]:
TBMM = datetime(1920, 4, 23, 14, 15, 10)

In [113]:
TBMM.year

1920

In [114]:
TBMM.second

10

## PANDAS ile Tarih Ops

In [115]:
import pandas as pd

In [116]:
tarih = pd.Series(["23/04/1920","Oct 29, 1923","1924-03-03"])

In [117]:
tarih

0      23/04/1920
1    Oct 29, 1923
2      1924-03-03
dtype: object

In [118]:
 pd.to_datetime(tarih)

C:\Users\emrek\AppData\Local\Temp\ipykernel_37780\1116112887.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.to_datetime(tarih)

0   1920-04-23
1   1923-10-29
2   1924-03-03
dtype: datetime64[ns]

YYYY / MM / DD

### EU VS US

* Avrupa

dd/mm/yyyy

* Amerika

mm/dd/yyyy

In [119]:
eu_date= "01-11-1928"

In [120]:
pd.to_datetime(eu_date)

Timestamp('1928-01-11 00:00:00')

## Tarihleri formatlamak

In [121]:
tarih_1 = "23rd of Aug 1921"

In [122]:
pd.to_datetime(tarih_1)

Timestamp('1921-08-23 00:00:00')

In [123]:
tarih_2 = "Aug 30th 1922"

In [124]:
pd.to_datetime(tarih_2)

Timestamp('1922-08-30 00:00:00')

In [125]:
tarih_3 = "9//Sep/-/1922"

In [126]:
pd.to_datetime(tarih_3, format="%d//%b/-/%Y")

Timestamp('1922-09-09 00:00:00')

In [127]:
df = pd.read_excel("müteahhit.xlsx")

In [128]:
df

          tarih  yeni müteahhit sayısı
0    2012-01-01                     10
1    2012-01-02                      1
2    2012-01-03                     24
3    2012-01-04                      3
4    2012-01-05                     30
...         ...                    ...
1456 2015-12-27                     37
1457 2015-12-28                     37
1458 2015-12-29                     80
1459 2015-12-30                     31
1460 2015-12-31                     80

[1461 rows x 2 columns]

In [129]:
type(df)

pandas.core.frame.DataFrame

In [131]:
type(df["tarih"])

pandas.core.series.Series

In [132]:
type(df["tarih"].iloc[456])

pandas._libs.tslibs.timestamps.Timestamp

# .dt

In [133]:
df["tarih"].dt.day

0        1
1        2
2        3
3        4
4        5
        ..
1456    27
1457    28
1458    29
1459    30
1460    31
Name: tarih, Length: 1461, dtype: int64

In [134]:
df["tarih"].dt.year

0       2012
1       2012
2       2012
3       2012
4       2012
        ...
1456    2015
1457    2015
1458    2015
1459    2015
1460    2015
Name: tarih, Length: 1461, dtype: int64

In [135]:
df["tarih"].dt.is_leap_year

0        True
1        True
2        True
3        True
4        True
        ...
1456    False
1457    False
1458    False
1459    False
1460    False
Name: tarih, Length: 1461, dtype: bool

## .resample()

In [137]:
df = df.set_index("tarih")

In [138]:
df

            yeni müteahhit sayısı
tarih
2012-01-01                     10
2012-01-02                      1
2012-01-03                     24
2012-01-04                      3
2012-01-05                     30
...                           ...
2015-12-27                     37
2015-12-28                     37
2015-12-29                     80
2015-12-30                     31
2015-12-31                     80

[1461 rows x 1 columns]

In [139]:
df.resample(rule="A").mean()

            yeni müteahhit sayısı
tarih
2012-12-31              35.114754
2013-12-31              47.887671
2014-12-31              54.326027
2015-12-31              58.030137

In [141]:
df.resample(rule="A").max()

            yeni müteahhit sayısı
tarih
2012-12-31                     85
2013-12-31                    104
2014-12-31                    114
2015-12-31                    122

In [142]:
df.resample(rule="SM").mean()

            yeni müteahhit sayısı
tarih
2011-12-31              17.357143
2012-01-15              28.000000
2012-01-31              19.266667
2012-02-15              25.500000
2012-02-29              30.866667
...                           ...
2015-10-31              68.000000
2015-11-15              55.933333
2015-11-30              50.800000
2015-12-15              55.625000
2015-12-31              80.000000

[97 rows x 1 columns]